In [1]:
import pandas as pd
import numpy as np
from pandas import Series,DataFrame

In [2]:
#start with series

obj=Series([3,5,-7,8])
obj

0    3
1    5
2   -7
3    8
dtype: int64

In [3]:
obj.values

array([ 3,  5, -7,  8])

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
obj2=Series([3,5,-7,8],index=['a','b','c','d'])
obj2

a    3
b    5
c   -7
d    8
dtype: int64

In [6]:
obj2['a']

3

In [7]:
obj2['a']=6
obj2

a    6
b    5
c   -7
d    8
dtype: int64

In [8]:
obj2[['c','a','d']]

c   -7
a    6
d    8
dtype: int64

In [9]:
obj2[obj2>0]

a    6
b    5
d    8
dtype: int64

In [10]:
sdata={'ohio':1,'alabama':2}
obj2=Series(sdata)
obj2

alabama    2
ohio       1
dtype: int64

In [11]:
states=['mississippi','utah','ohio']
obj=Series(sdata,index=states)
obj

mississippi    NaN
utah           NaN
ohio           1.0
dtype: float64

In [12]:
pd.isnull(obj)

mississippi     True
utah            True
ohio           False
dtype: bool

In [13]:
pd.notnull(obj)

mississippi    False
utah           False
ohio            True
dtype: bool

In [14]:
obj

mississippi    NaN
utah           NaN
ohio           1.0
dtype: float64

In [15]:
obj2

alabama    2
ohio       1
dtype: int64

In [16]:
obj+obj2

alabama        NaN
mississippi    NaN
ohio           2.0
utah           NaN
dtype: float64

In [17]:
#lets look at dataframe

In [18]:
data={'state':['ohio','ohio','ohio','nevada','nevada','nevada'],
     'year':[2000,2001,2002,2001,2002,2003],
     'pop':[1.5,1.3,3.6,2.4,2.9,3.2]}
frame=DataFrame(data)

In [19]:
frame

   pop   state  year
0  1.5    ohio  2000
1  1.3    ohio  2001
2  3.6    ohio  2002
3  2.4  nevada  2001
4  2.9  nevada  2002
5  3.2  nevada  2003

In [20]:
frame.head()

   pop   state  year
0  1.5    ohio  2000
1  1.3    ohio  2001
2  3.6    ohio  2002
3  2.4  nevada  2001
4  2.9  nevada  2002

In [21]:
DataFrame(data,columns=['year','state','pop'])

   year   state  pop
0  2000    ohio  1.5
1  2001    ohio  1.3
2  2002    ohio  3.6
3  2001  nevada  2.4
4  2002  nevada  2.9
5  2003  nevada  3.2

In [22]:
frame['state']

0      ohio
1      ohio
2      ohio
3    nevada
4    nevada
5    nevada
Name: state, dtype: object

In [23]:
frame.loc[3]

pop         2.4
state    nevada
year       2001
Name: 3, dtype: object

In [24]:
frame2=DataFrame(data,columns=['year','state','pop','debt'])

In [25]:
frame2

   year   state  pop debt
0  2000    ohio  1.5  NaN
1  2001    ohio  1.3  NaN
2  2002    ohio  3.6  NaN
3  2001  nevada  2.4  NaN
4  2002  nevada  2.9  NaN
5  2003  nevada  3.2  NaN

In [26]:
frame2['debt']=16
frame2

   year   state  pop  debt
0  2000    ohio  1.5    16
1  2001    ohio  1.3    16
2  2002    ohio  3.6    16
3  2001  nevada  2.4    16
4  2002  nevada  2.9    16
5  2003  nevada  3.2    16

In [27]:
frame2['debt']=np.arange(6.)
frame2

   year   state  pop  debt
0  2000    ohio  1.5   0.0
1  2001    ohio  1.3   1.0
2  2002    ohio  3.6   2.0
3  2001  nevada  2.4   3.0
4  2002  nevada  2.9   4.0
5  2003  nevada  3.2   5.0

In [28]:
val=Series([-1.2,-3,-2.4],index=[2,4,5])
frame2['debt']=val
frame2

   year   state  pop  debt
0  2000    ohio  1.5   NaN
1  2001    ohio  1.3   NaN
2  2002    ohio  3.6  -1.2
3  2001  nevada  2.4   NaN
4  2002  nevada  2.9  -3.0
5  2003  nevada  3.2  -2.4

In [29]:
frame2.T

          0     1     2       3       4       5
year   2000  2001  2002    2001    2002    2003
state  ohio  ohio  ohio  nevada  nevada  nevada
pop     1.5   1.3   3.6     2.4     2.9     3.2
debt    NaN   NaN  -1.2     NaN      -3    -2.4

In [53]:
obj=pd.Series(np.arange(5.),index=['a','b','c','d','e'])

In [31]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [32]:
new_obj=obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [33]:
obj.drop(['c','a'])

b    1.0
d    3.0
e    4.0
dtype: float64

In [36]:
data=pd.DataFrame(np.arange(16.).reshape(4,4),index=['ohio','colorado','utah','new york'],columns=['one','two','three','four'])
data

           one   two  three  four
ohio       0.0   1.0    2.0   3.0
colorado   4.0   5.0    6.0   7.0
utah       8.0   9.0   10.0  11.0
new york  12.0  13.0   14.0  15.0

In [37]:
data.drop(['colorado','new york'])

      one  two  three  four
ohio  0.0  1.0    2.0   3.0
utah  8.0  9.0   10.0  11.0

In [39]:
data.drop('two',axis=1)

           one  three  four
ohio       0.0    2.0   3.0
colorado   4.0    6.0   7.0
utah       8.0   10.0  11.0
new york  12.0   14.0  15.0

In [40]:
obj.drop('c',inplace=True)
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [43]:
obj=pd.Series(np.arange(4),index=['a','b','c','d'])
obj

a    0
b    1
c    2
d    3
dtype: int64

In [44]:
obj[['b','a']]

b    1
a    0
dtype: int64

In [46]:
obj[[1,3]]

b    1
d    3
dtype: int64

In [48]:
data=pd.DataFrame(np.arange(16).reshape(4,4),index=['ohio','colorado','utah','new york'],columns=['one','two','three','four'])
data

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11
new york   12   13     14    15

In [50]:
data['three']

ohio         2
colorado     6
utah        10
new york    14
Name: three, dtype: int64

In [51]:
data[data['three']>5]

          one  two  three  four
colorado    4    5      6     7
utah        8    9     10    11
new york   12   13     14    15

In [52]:
data<5

            one    two  three   four
ohio       True   True   True   True
colorado   True  False  False  False
utah      False  False  False  False
new york  False  False  False  False